notes/resources/regex/regex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-13 Thu 20:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Regular Expressions</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Regular Expressions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org15d00a3">1. Literal Characters</a></li>
<li><a href="#org0e49186">2. Special characters (metacharacters)</a>
<ul>
<li><a href="#orgaad3d8c">2.1. List of special characters</a></li>
<li><a href="#org632d9ef">2.2. Escaping special characters</a></li>
<li><a href="#org3fb1b47">2.3. Non-Printable characters</a></li>
</ul>
</li>
<li><a href="#org6f208b3">3. Character classes or character sets</a>
<ul>
<li><a href="#org03426a1">3.1. Escaping metacharacters</a></li>
<li><a href="#orgbf791fe">3.2. Finding characters</a></li>
<li><a href="#org757a52a">3.3. Negating characters</a></li>
<li><a href="#org6ff7a47">3.4. Classes subtraction</a></li>
<li><a href="#org50b2e5a">3.5. Classes intersection</a></li>
<li><a href="#org784159a">3.6. Shorthand classes</a></li>
</ul>
</li>
<li><a href="#org26a1908">4. Anchors</a></li>
<li><a href="#orga394b66">5. Examples</a>
<ul>
<li><a href="#orgb70568c">5.1. Date match</a></li>
<li><a href="#org07b4fdf">5.2. Email</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="../../index.html">Home Page</a>
</p>

<div id="outline-container-org15d00a3" class="outline-2">
<h2 id="org15d00a3"><span class="section-number-2">1</span> Literal Characters</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Literal characters get matched even inside of a string</li>
<li>Literal characters <b>are</b> case sensitive</li>
<li><code>a</code> in the regex will simply match all the <code>a</code> letters</li>
<li><code>cat</code> will match all the <code>cat</code> letters in the string</li>
</ul>
</div>
</div>
<div id="outline-container-org0e49186" class="outline-2">
<h2 id="org0e49186"><span class="section-number-2">2</span> Special characters (metacharacters)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaad3d8c" class="outline-3">
<h3 id="orgaad3d8c"><span class="section-number-3">2.1</span> List of special characters</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><code>\</code></li>
<li><code>^</code> : match the first character</li>
<li><code>$</code> : match the last character</li>
<li><code>.</code> : match a single character, except line breaks</li>
<li><code>|</code> : alteration, look for <code>cat|dog</code></li>
<li><code>?</code> : make the preceding operator optional, <code>colou?r</code>, matches "color" or "colour". Match zero times or once.</li>
<li><code>*</code> : match zero or more times</li>
<li><code>+</code> : match once or more times</li>
<li><code>(</code> and <code>)</code> @ grouping</li>
<li><code>[</code> : character class</li>
<li><code>{</code> repetition operator eg. <code>a{1,3}</code> match 1 to 3 letters "a"</li>
<li><code>\b</code> : word boundary. Eg. <code>\bword\b</code></li>
</ul>
</div>
</div>
<div id="outline-container-org632d9ef" class="outline-3">
<h3 id="org632d9ef"><span class="section-number-3">2.2</span> Escaping special characters</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>to match <code>1+1=2</code>, regex is <code>1\+1=2</code></li>
</ul>
</div>
</div>
<div id="outline-container-org3fb1b47" class="outline-3">
<h3 id="org3fb1b47"><span class="section-number-3">2.3</span> Non-Printable characters</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><code>\t</code> to match a tab</li>
<li><code>\r</code> to match a carriage return</li>
<li><code>\n</code> to match a line feed</li>
<li><code>\a</code> to match a bell</li>
<li><code>\e</code> to match a escape</li>
<li><code>\f</code> to match a form feed</li>
<li>Note: windows uses <code>\r\n</code> to terminate lines, *nix uses <code>\n</code></li>
<li><code>\uFFFF</code> or <code>\x{FFFF}</code> for Unicode characters</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6f208b3" class="outline-2">
<h2 id="org6f208b3"><span class="section-number-2">3</span> Character classes or character sets</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org03426a1" class="outline-3">
<h3 id="org03426a1"><span class="section-number-3">3.1</span> Escaping metacharacters</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>In most regex flavours you only have to escape <code>]</code>, <code>\</code>, <code>-</code> and <code>^</code>, inside ot the <code>[]</code> class</li>
</ul>
</div>
</div>
<div id="outline-container-orgbf791fe" class="outline-3">
<h3 id="orgbf791fe"><span class="section-number-3">3.2</span> Finding characters</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>gr[ae]y</code> matches "gray" or "grey"</li>
<li><code>[0-9]</code> matches a single digit from 0 to 9</li>
<li><code>[0-9a-fA-F]</code> matches a single digit hex digit, case insensitive</li>
<li><code>0[xX][A-Fa-f0-9]+</code> C style hex number</li>
</ul>
</div>
</div>
<div id="outline-container-org757a52a" class="outline-3">
<h3 id="org757a52a"><span class="section-number-3">3.3</span> Negating characters</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><code>[^0-9\n]</code> matches any non digit or a line feed</li>
</ul>
</div>
</div>
<div id="outline-container-org6ff7a47" class="outline-3">
<h3 id="org6ff7a47"><span class="section-number-3">3.4</span> Classes subtraction</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li><code>[a-z-[aeiuo]]</code> match a non vowel character. Read as match all characters from a to z, but not any of the vowels.</li>
</ul>
</div>
</div>
<div id="outline-container-org50b2e5a" class="outline-3">
<h3 id="org50b2e5a"><span class="section-number-3">3.5</span> Classes intersection</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li><code>[a-z&amp;&amp;[^aeiuo]]</code> match a consonant. Read as match all characters but not any of the vowels</li>
</ul>
</div>
</div>
<div id="outline-container-org784159a" class="outline-3">
<h3 id="org784159a"><span class="section-number-3">3.6</span> Shorthand classes</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li><code>\d\D</code> digit and non-digit, same as <code>[0-9]</code></li>
<li><code>\w\W</code> word and non-word, same as <code>[A-Za-z0-9_]</code>, can be inconsistent, flavours differ this shorthand's functionality</li>
<li><code>\sS</code> whitespace character and non-whitespace, same as <code>[ \t\r\n\f]</code>, space, tab, carriage return, line feed and form feed</li>
<li>NOTE, that <code>\s\d</code> meand match a whitespace <b>followed</b> by a digit, where <code>[\s\d]</code> means match a <b>single</b> character that is a whitespace or a digit</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org26a1908" class="outline-2">
<h2 id="org26a1908"><span class="section-number-2">4</span> Anchors</h2>
</div>
<div id="outline-container-orga394b66" class="outline-2">
<h2 id="orga394b66"><span class="section-number-2">5</span> Examples</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgb70568c" class="outline-3">
<h3 id="orgb70568c"><span class="section-number-3">5.1</span> Date match</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>[01]\d[- /.][0-3]\d[- /.]\d\d</code>
</p>
</div>
</div>
<div id="outline-container-org07b4fdf" class="outline-3">
<h3 id="org07b4fdf"><span class="section-number-3">5.2</span> Email</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<code>\b[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}\b</code>
</p>

<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-10 Sat 13:12</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2018-12-13 Thu 20:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
